flow_over_plate/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          41;
        startFace       23692;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          41;
        startFace       23733;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          293;
        startFace       23774;
    }
    fluid_slip-bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          81;
        startFace       24067;
    }
    fluid_no_slip-bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          51;
        startFace       24148;
    }
    front_back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          24026;
        startFace       24199;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          190;
        startFace       48225;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_fluid;
    }
)

// ************************************************************************* //
