flow_over_plate/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 310;

boundaryField
{
#includeEtc "caseDicts/setConstraintTypes"
    solid_bottom
    {
        type            fixedValue;
        value           uniform 310;
    }
    solid_sides
    {
        type            zeroGradient;
    }
    front_back
    {
        type            empty;
    }
   solid_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    
}


// ************************************************************************* //
