flow_over_plate/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

//SPECIFY FLUID ZONE
    {
        action  new;
        type    cellSet;
        name    c0;
        source  boxToCell;
        sourceInfo
        {
            box (-0.5 0 0) (3 0.5 0.4); 
        }
     }
        
     {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c0; 
        }
    }
//SPECIFY SOLID ZONE 

      {
        action  new;
        type    cellSet;
        name    c0;
        source  boxToCell;
        sourceInfo
        {
            box (0 -0.25 0) (1 0 0.4); 
        }
     }
        
     {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c0; 
        }
    }
  
  
  
  
  
  
  
  
  
  
);

// ************************************************************************* //
